[
    {
        "title": "Life_Query",
        "link": "https://search.shopping.naver.com/book/catalog/55065001919",
        "image": "https://shopping-phinf.pstatic.net/main_5506500/55065001919.20250601111412.jpg",
        "author": "",
        "discount": "70280",
        "publisher": "Xlibris US",
        "pubdate": "20250505",
        "isbn": "9798369445099",
        "description": "What if the remnants of discarded dreams could be reshaped into something new?  What if every failed attempt, every half-reached enterprise, and every fleeting connection carried the weight of something more- something is waiting to be reborn."
    },
    {
        "title": "Life_Query",
        "link": "https://search.shopping.naver.com/book/catalog/55065002718",
        "image": "https://shopping-phinf.pstatic.net/main_5506500/55065002718.20250601111443.jpg",
        "author": "",
        "discount": "38830",
        "publisher": "Xlibris US",
        "pubdate": "20250505",
        "isbn": "9798369445105",
        "description": "What if the remnants of discarded dreams could be reshaped into something new?  What if every failed attempt, every half-reached enterprise, and every fleeting connection carried the weight of something more- something is waiting to be reborn."
    },
    {
        "title": "The Query",
        "link": "https://search.shopping.naver.com/book/catalog/32462215883",
        "image": "https://shopping-phinf.pstatic.net/main_3246221/32462215883.20250518074844.jpg",
        "author": "",
        "discount": "36900",
        "publisher": "Parson's Porch",
        "pubdate": "20190801",
        "isbn": "9781949888997",
        "description": "The Query is a collection of stories - stories of hope - arising from a simple question: “What is the reason for the hope that is within you?”?They were gathered through chance encounters with strangers across America: On airplanes, in restaurants or cafes, at a car dealership, in a jury waiting room."
    },
    {
        "title": "Learning Power Query (Simplify data cleaning and analysis with Excel’s most powerful tool (English Edition))",
        "link": "https://search.shopping.naver.com/book/catalog/56543759063",
        "image": "https://shopping-phinf.pstatic.net/main_5654375/56543759063.20250901131651.jpg",
        "author": "",
        "discount": "73900",
        "publisher": "BPB Publications",
        "pubdate": "20250829",
        "isbn": "9789365891539",
        "description": "In a time where data drives decision-making, Excel continues to be a vital resource for professionals. Power Query greatly enhances its functionality. As businesses increasingly seek automation and scalable solutions, proficiency in Power Query and the M language is a crucial advantage for data practitioners. This book fulfills that demand by combining technical accuracy with practical examples."
    },
    {
        "title": "Structured Query Language",
        "link": "https://search.shopping.naver.com/book/catalog/57287222623",
        "image": "https://shopping-phinf.pstatic.net/main_5728722/57287222623.20260116071955.jpg",
        "author": "",
        "discount": "29580",
        "publisher": "Woody R. Clermont",
        "pubdate": "20251013",
        "isbn": "9798232105068",
        "description": "Structured Query Language: SQL Concepts and Comic ReliefBy Woody R. Clermont, author of Foundations of Data Science and Statistics: Analytics Made Simple and Strategic MicroeconomicsLearn SQL for beginners the fun way - with concepts, queries, and a dash of humor.Structured Query Language: SQL Concepts and Comic Relief is the beginner-friendly SQL book that teaches you how to write SQL queries, manage databases, and understand core SQL concepts - without putting you to sleep."
    },
    {
        "title": "Test Anxiety in Foreign Language Assessment (A Query to Pender)",
        "link": "https://search.shopping.naver.com/book/catalog/32461360779",
        "image": "https://shopping-phinf.pstatic.net/main_3246136/32461360779.20250609090339.jpg",
        "author": "",
        "discount": "122100",
        "publisher": "KS OmniScriptum Publishing",
        "pubdate": "20210326",
        "isbn": "9786200460202",
        "description": "Foreign language learning is a journey of hardships and challenges, students during their years of study face many problems that affect their future life and career. Test anxiety, as a psychological state, plays a pivotal role in educational psychology among academic research including the variety of influences it engenders on learners' performances."
    },
    {
        "title": "SQL MASTERY (DALLE QUERY ALL’OTTIMIZZAZIONE)",
        "link": "https://search.shopping.naver.com/book/catalog/56643681459",
        "image": "https://shopping-phinf.pstatic.net/main_5664368/56643681459.20250908202447.jpg",
        "author": "",
        "discount": "129500",
        "publisher": "KS OmniScriptum Publishing",
        "pubdate": "20250730",
        "isbn": "9786202331708",
        "description": "Questo libro si rivolge a un vasto pubblico, dagli studenti che hanno appena iniziato a esplorare il mondo dei database ai professionisti che desiderano perfezionare le proprie capacita SQL e sfruttare appieno il potenziale dei sistemi di database. Sia che stiate scrivendo la vostra prima istruzione SELECT o che siate alle prese con piani di esecuzione e strategie di ottimizzazione, questo libro e una risorsa chiara, strutturata e completa."
    },
    {
        "title": "San Francisco Drag: A Coloring Book",
        "link": "https://search.shopping.naver.com/book/catalog/51446517899",
        "image": "https://shopping-phinf.pstatic.net/main_5144651/51446517899.20260209073344.jpg",
        "author": "",
        "discount": "0",
        "publisher": "Query Books LLC",
        "pubdate": "20151208",
        "isbn": "9781944507008",
        "description": "Finally, a queer take on the adult coloring book! \n\nMeg Murray created 50 images of some of the most iconic performers working in San Francisco today, spanning the spectrum from legendary diva to baby queen."
    },
    {
        "title": "Power Query Cookbook (Use effective and powerful queries in Power BI Desktop and Dataflows to prepare and transform your data)",
        "link": "https://search.shopping.naver.com/book/catalog/32459279085",
        "image": "https://shopping-phinf.pstatic.net/main_3245927/32459279085.20221228074936.jpg",
        "author": "Andrea Janicijevic",
        "discount": "41000",
        "publisher": "Packt Publishing",
        "pubdate": "20220301",
        "isbn": "9781800569485",
        "description": "Power Query provides an easy-to-use GUI that allows you to achieve powerful data transformations within the M programming language. This book will show you how easy it is to learn the M language and its many AI-powered functions for auto-generating M code. It will also prepare you to use complex M functions."
    },
    {
        "title": "96 Common Challenges in Power Query (Practical Solutions for Mastering Data Transformation in Excel and Power BI)",
        "link": "https://search.shopping.naver.com/book/catalog/55671096753",
        "image": "https://shopping-phinf.pstatic.net/main_5567109/55671096753.20250707165538.jpg",
        "author": "",
        "discount": "110980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20250705",
        "isbn": "9798868812873",
        "description": "This comprehensive guide is designed to address the most frequent and challenging issues faced by users of Power Query, a powerful data transformation tool integrated into Excel, Power BI, and Microsoft Azure.?By tackling 96 real-world problems with practical, step-by-step solutions, this book is an essential resource for data analysts, Excel enthusiasts, and Power BI professionals.?It aims to enhance your data transformation skills and improve efficiency in handling complex data sets."
    },
    {
        "title": "Power Query Beyond The User Interface (Solving Advanced Data Cleaning Problems Using M (Colour Version))",
        "link": "https://search.shopping.naver.com/book/catalog/54526650767",
        "image": "https://shopping-phinf.pstatic.net/main_5452665/54526650767.20250501132930.jpg",
        "author": "",
        "discount": "116530",
        "publisher": "Repro India Limited",
        "pubdate": "20250228",
        "isbn": "9781615470891",
        "description": "About the Book This book is a practical guide for business users who rely on Microsoft Power Query to clean and transform messy data. It explains how to go beyond the user interface by focusing on the M language behind Power Query. This is not a conventional textbook. Three key things set it apart: 1. It shows how to think and build solutions, not just how to use M functions. Readers can apply what they learn to their own data. 2."
    },
    {
        "title": "SAP Query Reporting",
        "link": "https://search.shopping.naver.com/book/catalog/32467212682",
        "image": "https://shopping-phinf.pstatic.net/main_3246721/32467212682.20250605090014.jpg",
        "author": "Larocca, Danielle",
        "discount": "75830",
        "publisher": "Sams",
        "pubdate": "20060724",
        "isbn": "9780672329029",
        "description": "Everything an SAP user needs to know to create their own reports in SAP using Query tools, no programming required!"
    },
    {
        "title": "State Management with React Query",
        "link": "https://search.shopping.naver.com/book/catalog/40622486624",
        "image": "https://shopping-phinf.pstatic.net/main_4062248/40622486624.20230615202247.jpg",
        "author": "Afonso, Daniel",
        "discount": "29000",
        "publisher": "Packt Publishing",
        "pubdate": "20230512",
        "isbn": "9781803231341",
        "description": ""
    },
    {
        "title": "PostgreSQL Query Optimization (The Ultimate Guide to Building Efficient Queries)",
        "link": "https://search.shopping.naver.com/book/catalog/47340567226",
        "image": "https://shopping-phinf.pstatic.net/main_4734056/47340567226.20250427073945.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20210423",
        "isbn": "9781484268865",
        "description": "Write optimized queries. This book helps you write queries that perform fast and deliver results on time. You will learn that query optimization is not a dark art practiced by a small, secretive cabal of sorcerers. Any motivated professional can learn to write efficient queries from the get-go and capably optimize existing queries. You will learn to look at the process of writing a query from the database engine's point of view, and know how to think like the database optimizer."
    },
    {
        "title": "SEMANTIC WEB QUERY OPTIMIZATION",
        "link": "https://search.shopping.naver.com/book/catalog/32443153872",
        "image": "https://shopping-phinf.pstatic.net/main_3244315/32443153872.20250626094215.jpg",
        "author": "",
        "discount": "92500",
        "publisher": "KS OmniScriptum Publishing",
        "pubdate": "20210219",
        "isbn": "9786203461923",
        "description": "The semantic web is similar to the normal web with the structured format and hence the machine learning techniques can easily process the data. Standard format to represent the semantic web data is Resource Description Framework (RDF). In this, the query is structured as SPARQL Protocol and RDF Query Language (SPARQL) to process the data. Various methods have been applied in the semantic web to increase the efficiency and to reduce the computation time."
    },
    {
        "title": "Ultimate Excel with Power Query and ChatGPT",
        "link": "https://search.shopping.naver.com/book/catalog/44707182460",
        "image": "https://shopping-phinf.pstatic.net/main_4470718/44707182460.20250407071247.jpg",
        "author": "",
        "discount": "60950",
        "publisher": "Orange Education Pvt Ltd",
        "pubdate": "20231205",
        "isbn": "9788196782610",
        "description": "Transform Your MS Excel Skills with this Ultimate Guide for Professional SuccessBook DescriptionThe?Ultimate Excel with Power Query and ChatGPT?is a revolutionary handbook to help you embark on a transformative journey through the intricate world of Excel's lookup functions. The book dives deep into Excel's lookup universe, offering a meticulous exploration of over 100 techniques. Each method is presented with clarity and precision, making even the most complex lookup scenarios comprehensible."
    },
    {
        "title": "Society of the Query Reader (Reflections on Web Search)",
        "link": "https://search.shopping.naver.com/book/catalog/32524531666",
        "image": "https://shopping-phinf.pstatic.net/main_3252453/32524531666.20250629080049.jpg",
        "author": "",
        "discount": "28040",
        "publisher": "Instituut voor Netwerkcultuur",
        "pubdate": "20140422",
        "isbn": "9789081857581",
        "description": "Looking up something online is one of the most common applications of the web. Whether with a laptop or smartphone, we search the web from wherever we are, at any given moment. 'Googling' has become so entwined in our daily routines that we rarely question it. However, search engines such as Google or Bing determine what part of the web we get to see, shaping our knowledge and perceptions of the world. But there is a world beyond Google - geographically, culturally, and technologically."
    },
    {
        "title": "Query Store for SQL Server 2019 (Identify and Fix Poorly Performing Queries)",
        "link": "https://search.shopping.naver.com/book/catalog/47340567965",
        "image": "https://shopping-phinf.pstatic.net/main_4734056/47340567965.20250606090808.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20191004",
        "isbn": "9781484250051",
        "description": "Apply the new Query Store feature to identify and fix poorly performing queries in SQL Server.Query Store is an important and recent feature in SQL Server that provides insight into the details of query execution and how that execution has changed over time. Query Store helps to identify queries that aren't performing well, or that have regressed in their performance."
    },
    {
        "title": "Query Answer Authentication",
        "link": "https://search.shopping.naver.com/book/catalog/32492362901",
        "image": "https://shopping-phinf.pstatic.net/main_3249236/32492362901.20250414072456.jpg",
        "author": "",
        "discount": "74000",
        "publisher": "Morgan & Claypool",
        "pubdate": "20120531",
        "isbn": "9781608457656",
        "description": "In data publishing, the owner delegates the role of satisfying user queries to a third-party publisher. As the servers of the publisher may be untrusted or susceptible to attacks, we cannot assume that they would always process queries correctly, hence there is a need for users to authenticate their query answers.\nThis book introduces various notions that the research community has studied for defining the correctness of a query answer."
    },
    {
        "title": "Query Answer Authentication",
        "link": "https://search.shopping.naver.com/book/catalog/32884601829",
        "image": "https://shopping-phinf.pstatic.net/main_3288460/32884601829.20250409072420.jpg",
        "author": "",
        "discount": "70280",
        "publisher": "Springer",
        "pubdate": "20120401",
        "isbn": "9783031007590",
        "description": "In data publishing, the owner delegates the role of satisfying user queries to a third-party publisher."
    },
    {
        "title": "Query Answer Authentication",
        "link": "https://search.shopping.naver.com/book/catalog/47340568244",
        "image": "https://shopping-phinf.pstatic.net/main_4734056/47340568244.20250620084627.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20120401",
        "isbn": "9783031030154",
        "description": "In data publishing, the owner delegates the role of satisfying user queries to a third-party publisher. As the servers of the publisher may be untrusted or susceptible to attacks, we cannot assume that they would always process queries correctly, hence there is a need for users to authenticate their query answers. This book introduces various notions that the research community has studied for defining the correctness of a query answer."
    },
    {
        "title": "MySQL 8 Query Performance Tuning (A Systematic Method for Improving Execution Speeds)",
        "link": "https://search.shopping.naver.com/book/catalog/47340624944",
        "image": "https://shopping-phinf.pstatic.net/main_4734062/47340624944.20250428072034.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20200319",
        "isbn": "9781484255858",
        "description": "Identify, analyze, and improve poorly performing queries that damage user experience and lead to lost revenue for your business. This book will help you make query tuning an integral part of your daily routine through a multi-step process that includes monitoring of execution times, identifying candidate queries for optimization, analyzing their current performance, and improving them to deliver results faster and with less overhead."
    },
    {
        "title": "SQL Server 2022 Query Performance Tuning (Troubleshoot and Optimize Query Performance)",
        "link": "https://search.shopping.naver.com/book/catalog/47340568304",
        "image": "https://shopping-phinf.pstatic.net/main_4734056/47340568304.20250609084312.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20221110",
        "isbn": "9781484288924",
        "description": "Troubleshoot slow-performing queries and make them run faster. Database administrators and SQL developers are constantly under pressure to provide more speed. This new edition?has been redesigned and rewritten from scratch based on the last 15 years of learning, knowledge, and experience accumulated by the author. The book Includes expanded information on using extended events, automatic execution plan correction, and other advanced features now available in SQL Server."
    },
    {
        "title": "SQL Query Design Patterns and Best Practices (A practical guide to writing readable and maintainable SQL queries using its design patterns)",
        "link": "https://search.shopping.naver.com/book/catalog/38595867045",
        "image": "https://shopping-phinf.pstatic.net/main_3859586/38595867045.20240201071542.jpg",
        "author": "Steve Hughes^Dennis Neer^Ram Babu Singh^Shabbir H. Mala^Leslie Andrews",
        "discount": "32000",
        "publisher": "Packt Publishing",
        "pubdate": "20230331",
        "isbn": "9781837633289",
        "description": "Enhance your SQL query writing skills to provide greater business value using advanced techniques such as common table expressions, window functions, and JSON\n\nPurchase of the print or Kindle book includes a free PDF eBook\n\nKey Features\n\n- Examine query design and performance using query plans and indexes\n- Solve business problems using advanced techniques such as common table expressions and window functions\n- Use SQL in modern data platform solutions with JSON and Jupyter notebooks"
    },
    {
        "title": "Inside Microsoft SQL Server 2005 (Query Tuning and Optimization)",
        "link": "https://search.shopping.naver.com/book/catalog/32480598932",
        "image": "https://shopping-phinf.pstatic.net/main_3248059/32480598932.20250416072310.jpg",
        "author": "Delaney, Kalen",
        "discount": "75830",
        "publisher": "Microsoft Press",
        "pubdate": "20070926",
        "isbn": "9780735621961",
        "description": "Dive deep into the internals of query tuning and optimization in SQL Server 2005 with this comprehensive reference. Understanding the internals of SQL Server helps database developers and administrators to better create, access, and effectively process information from enterprise data. Written by experts on SQL Server, this volume from the Inside Microsoft SQL Server series of books focuses on query tuning and optimization. You'll take an in-depth look at the best ways to make queries more effic..."
    },
    {
        "title": "Learning Apache Drill: Query and Analyze Distributed Data Sources with SQL (Query and Analyze Structured Data)",
        "link": "https://search.shopping.naver.com/book/catalog/32548000553",
        "image": "https://shopping-phinf.pstatic.net/main_3254800/32548000553.20250412080534.jpg",
        "author": "",
        "discount": "99880",
        "publisher": "O'Reilly Media",
        "pubdate": "20181117",
        "isbn": "9781492032793",
        "description": "In this practical book, Drill committers Charles Givre and Paul Rogers show analysts and data scientists how to query and analyze raw data using this powerful tool."
    },
    {
        "title": "Plug-and-Play Visual Subgraph Query Interfaces",
        "link": "https://search.shopping.naver.com/book/catalog/47340550796",
        "image": "https://shopping-phinf.pstatic.net/main_4734055/47340550796.20250502075028.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20230314",
        "isbn": "9783031161636",
        "description": "This book details recent developments in the emerging area of plug-and-play (PnP) visual subgraph query interfaces (VQI). These PnP interfaces are grounded in the principles of human-computer interaction (HCI) and cognitive psychology to address long-standing limitations to bottom-up search capabilities in graph databases using traditional graph query languages, which often require domain experts and specialist programmers."
    },
    {
        "title": "The Definitive Guide to Power Query (M): Mastering Complex Data Transformation with Power Query (Mastering Complex Data Transformation with Power Query)",
        "link": "https://search.shopping.naver.com/book/catalog/46925941814",
        "image": "https://shopping-phinf.pstatic.net/main_4692594/46925941814.20260115074406.jpg",
        "author": "Deckler, Greg^Groot, Rick de^Korte, Melissa de",
        "discount": "101730",
        "publisher": "Packt Publishing",
        "pubdate": "20240329",
        "isbn": "9781835089729",
        "description": "Learn how to use the Power Query M formula language and its functions effectively for better data modeling and impactful business intelligence reports."
    },
    {
        "title": "SQL (Structured Query Language)",
        "link": "https://search.shopping.naver.com/book/catalog/33434707722",
        "image": "https://shopping-phinf.pstatic.net/main_3343470/33434707722.20221228072644.jpg",
        "author": "조성건",
        "discount": "0",
        "publisher": "내하출판사",
        "pubdate": "20100201",
        "isbn": "9788957172766",
        "description": "SQL 언어는 많은 량의 데이터를 가공 처리하고 운영하는데 반드시 필요하다. 그리고 세계적으로 가장 많이 사용하고 있는 오라클 데이터베이스이다. 이 책은 OCA나 OCP 국제공인인증서를 취득하고자 하는 학생들에게 도움을 주기 위해, 수험서의 형식을 취하고 있는 SQL 데이터베이스 교재이다."
    },
    {
        "title": "Excel Power Pivot & Power Query for Dummies",
        "link": "https://search.shopping.naver.com/book/catalog/38448825621",
        "image": "https://shopping-phinf.pstatic.net/main_3844882/38448825621.20250628074654.jpg",
        "author": "",
        "discount": "41680",
        "publisher": "For Dummies",
        "pubdate": "20220302",
        "isbn": "9781119844488",
        "description": "Learn to crunch huge amounts of data with PowerPivot and Power Query  Do you have a ton of data you need to make sense of? Microsoft’s Excel program can handle amazingly large data sets, but you’ll need to get familiar with PowerPivot and Power Query to get started.  And that’s where Dummies comes in."
    },
    {
        "title": "Flexible Query Answering Systems",
        "link": "https://search.shopping.naver.com/book/catalog/33836117986",
        "image": "https://shopping-phinf.pstatic.net/main_3383611/33836117986.20250409072521.jpg",
        "author": "",
        "discount": "314480",
        "publisher": "Springer",
        "pubdate": "19970930",
        "isbn": "9780792380016",
        "description": "Flexible Query Answering Systems is an edited collection  of contributed chapters. It focuses on developing computer systems  capable of transforming a query into an answer with useful\n                            information. The emphasis is on problems associated with high-level  intelligent answering systems."
    },
    {
        "title": "The Querying Databricks with Spark SQL (Leverage SQL to query and analyze Big Data for insights)",
        "link": "https://search.shopping.naver.com/book/catalog/50898371646",
        "image": "https://shopping-phinf.pstatic.net/main_5089837/50898371646.20250627084346.jpg",
        "author": "",
        "discount": "67960",
        "publisher": "BPB Publications",
        "pubdate": "20231106",
        "isbn": "9789355518019",
        "description": "Additionally, it discusses correlated subqueries, joining and filtering datasets, using SQL in calculations, segmenting and classifying data, rolling analysis, and analyzing data over time. The book concludes with a chapter on advanced data presentation."
    },
    {
        "title": "Un sistema di raccomandazione delle query innovativo ed efficiente",
        "link": "https://search.shopping.naver.com/book/catalog/52663835695",
        "image": "https://shopping-phinf.pstatic.net/main_5266383/52663835695.20260117072813.jpg",
        "author": "",
        "discount": "103600",
        "publisher": "Edizioni Sapienza",
        "pubdate": "20250114",
        "isbn": "9786208553142",
        "description": "Internet ci aiuta a ottenere tutte le informazioni necessarie, ma la domanda e se le informazioni recuperate sono pertinenti o meno. Il sistema di raccomandazione delle query aiuta l'utente a trovare informazioni accurate dal corpus Web in modo efficiente. Il motore di ricerca viene utilizzato quando l'utente conosce la propria query. L'utente preferisce utilizzare un sistema di raccomandazione quando non sa quale query deve essere inviata al motore di ricerca."
    },
    {
        "title": "Power Query for Power Bi and Excel",
        "link": "https://search.shopping.naver.com/book/catalog/32454450174",
        "image": "https://shopping-phinf.pstatic.net/main_3245445/32454450174.20260125085043.jpg",
        "author": "",
        "discount": "0",
        "publisher": "Apress",
        "pubdate": "20140806",
        "isbn": "9781430266914",
        "description": "Power Query for Power BI and Excel is a book for people who are tired of copying and pasting data into Excel worksheets."
    },
    {
        "title": "Query Selection in Deep Web Crawling",
        "link": "https://search.shopping.naver.com/book/catalog/32445681808",
        "image": "https://shopping-phinf.pstatic.net/main_3244568/32445681808.20250626094530.jpg",
        "author": "",
        "discount": "114700",
        "publisher": "Scholars' Press",
        "pubdate": "20140304",
        "isbn": "9783639712452",
        "description": "The deep web is the content that is dynamically generated from data sources such as databases or file system. Unlike surface web where web pages are collected by following the hyperlinks embedded inside collected pages, data from a deep web data source is guarded by a search interface and only can be retrieved by queries.  The amount of data in deep web exceeds by far that of the surface web."
    },
    {
        "title": "Pro Linq: Language Integrated Query in C# 2010 (Language Integrated Query in C# 2010)",
        "link": "https://search.shopping.naver.com/book/catalog/32463535846",
        "image": "https://shopping-phinf.pstatic.net/main_3246353/32463535846.20250603073144.jpg",
        "author": "Rattz, Jr./Rattz, Joseph C., Jr./Freeman, Adam",
        "discount": "92480",
        "publisher": "Apress",
        "pubdate": "20100630",
        "isbn": "9781430226536",
        "description": "Demonstrating the overwhelming majority of LINQ operators and prototypes, it is a veritable treasury of LINQ examples. Rather than obscure the relevant LINQ principles in code examples by focusing on a demonstration application you have no interest in writing, this book cuts right to the chase of each LINQ operator, method, or class."
    },
    {
        "title": "Valutazione delle applicazioni di query MPEG-7",
        "link": "https://search.shopping.naver.com/book/catalog/32505254049",
        "image": "https://shopping-phinf.pstatic.net/main_3250525/32505254049.20250622102003.jpg",
        "author": "",
        "discount": "85100",
        "publisher": "KS OmniScriptum Publishing",
        "pubdate": "20210125",
        "isbn": "9786202757096",
        "description": "In questo libro, l'interfaccia e le funzioni delle applicazioni di query multimediali audio e video basate sullo standard MPEG-7 sono state valutate in base ai requisiti del formato di query MPEG-7 sviluppati da MPEG. Questo libro rappresenta diversi tipi di applicazioni multimediali MPEG-7, fornisce suggerimenti di progettazione per gli sviluppatori sulla base dei criteri di valutazione e fornisce consigli pratici ai documenti standard ISO."
    },
    {
        "title": "Inside the SQL Server Query Optimizer",
        "link": "https://search.shopping.naver.com/book/catalog/32515100713",
        "image": "https://shopping-phinf.pstatic.net/main_3251510/32515100713.20250606084019.jpg",
        "author": "",
        "discount": "45490",
        "publisher": "Simple Talk Publishing",
        "pubdate": "20110307",
        "isbn": "9781906434601",
        "description": "The SQL Server Query Optimizer is perceived by many to be a magic black box, transforming SQL queries into high performance execution plans in the blink of an eye through some unknowable process. The truth is that, while the Query Optimizer is indeed the highly-complex result of decades of research, learning how it works its magic is not only possible, but immensely useful to DBAs and Developers alike."
    },
    {
        "title": "Rilevamento su rete neurale di query di database ad alta intensita di risorse",
        "link": "https://search.shopping.naver.com/book/catalog/56503387741",
        "image": "https://shopping-phinf.pstatic.net/main_5650338/56503387741.20250829233046.jpg",
        "author": "",
        "discount": "133200",
        "publisher": "KS OmniScriptum Publishing",
        "pubdate": "20250227",
        "isbn": "9786208651459",
        "description": "Il sistema di elaborazione delle informazioni del server spende una quantita inaccettabile di risorse computazionali, oltre che di tempo e di risorse di archiviazione, per eseguire query di database ad alta intensita di risorse."
    },
    {
        "title": "Query Processing over Incomplete Databases",
        "link": "https://search.shopping.naver.com/book/catalog/32466504722",
        "image": "https://shopping-phinf.pstatic.net/main_3246650/32466504722.20250625084551.jpg",
        "author": "",
        "discount": "129400",
        "publisher": "Morgan & Claypool",
        "pubdate": "20180820",
        "isbn": "9781681734224",
        "description": "Incomplete data is part of life and almost all areas of scientific studies. Users tend to skip certain fields when they fill out online forms; participants choose to ignore sensitive questions on surveys; sensors fail, resulting in the loss of certain readings; publicly viewable satellite map services have missing data in many mobile applications; and in privacy-preserving applications, the data is incomplete deliberately in order to preserve the sensitivity of some attribute values."
    },
    {
        "title": "Query Processing over Incomplete Databases",
        "link": "https://search.shopping.naver.com/book/catalog/32884612770",
        "image": "https://shopping-phinf.pstatic.net/main_3288461/32884612770.20250627081655.jpg",
        "author": "",
        "discount": "110980",
        "publisher": "Springer",
        "pubdate": "20180820",
        "isbn": "9783031007354",
        "description": "We first elaborate the three general kinds of methods of handling incomplete data, including (i) discarding the data with missing values, (ii) imputation for the missing values, and (iii) just depending on the observed data values."
    },
    {
        "title": "SQL Server 2017 Query Performance Tuning: Troubleshoot and Optimize Query Performance (Troubleshoot and Optimize Query Performance)",
        "link": "https://search.shopping.naver.com/book/catalog/35300012455",
        "image": "https://shopping-phinf.pstatic.net/main_3530001/35300012455.20221018140611.jpg",
        "author": "Fritchey, Grant",
        "discount": "27740",
        "publisher": "Apress",
        "pubdate": "20181217",
        "isbn": "9781484238875",
        "description": "Tagline: None"
    },
    {
        "title": "SQL Cookbook: Query Solutions and Techniques for All SQL Users (Query Solutions and Techniques for All SQL Users)",
        "link": "https://search.shopping.naver.com/book/catalog/32483338236",
        "image": "https://shopping-phinf.pstatic.net/main_3248333/32483338236.20250413072703.jpg",
        "author": "Molinaro, Anthony^Graaf, Robert de",
        "discount": "64990",
        "publisher": "O'Reilly Media",
        "pubdate": "20201124",
        "isbn": "9781492077442",
        "description": "You may know SQL basics, but are you taking advantage of its expressive power? This second edition applies a highly practical approach to Structured Query Language (SQL) so you can create and manipulate large stores of data."
    },
    {
        "title": "Index and Query Methods in Road Networks",
        "link": "https://search.shopping.naver.com/book/catalog/47342747655",
        "image": "https://shopping-phinf.pstatic.net/main_4734274/47342747655.20250624091004.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20141008",
        "isbn": "9783319107905",
        "description": "This book presents the index and query techniques on road network and moving objects which are limited to road network. Here, the road network of non-Euclidean space has its unique characteristics such that two moving objects may be very close in a straight line distance. The index used in two-dimensional Euclidean space is not always appropriate for moving objects on road network."
    },
    {
        "title": "Rejections From a Literary Agent (Discouraging Writers, One Bad Query at a Time)",
        "link": "https://search.shopping.naver.com/book/catalog/32511706065",
        "image": "https://shopping-phinf.pstatic.net/main_3251170/32511706065.20260208084407.jpg",
        "author": "",
        "discount": "0",
        "publisher": "Virtualbookworm.com",
        "pubdate": "20190130",
        "isbn": "9781949756197",
        "description": "Satirical humor books have built success on very serious topics ? FURIOUSLY HAPPY by Jenny Lawson (mental illness), SHI*T MY DAD SAYS by Justin Halpern (awkward relations) and CALYPSO by David Sedaris (alcoholism, suicide) ? but no one has yet written anything funny about the arduous process of trying to snag a literary agent."
    },
    {
        "title": "Query Processing Over Uncertain Databases",
        "link": "https://search.shopping.naver.com/book/catalog/32529791727",
        "image": "https://shopping-phinf.pstatic.net/main_3252979/32529791727.20250528074233.jpg",
        "author": "",
        "discount": "74000",
        "publisher": "Morgan & Claypool",
        "pubdate": "20121230",
        "isbn": "9781608458929",
        "description": "Due to measurement errors, transmission lost, or injected noise for privacy protection, uncertainty exists in the data of many real applications. However, query processing techniques for deterministic data cannot be directly applied to uncertain data because they do not have mechanisms to handle data uncertainty. Therefore, efficient and effective manipulation of uncertain data is a practical yet challenging research topic."
    },
    {
        "title": "Query Processing over Uncertain Databases",
        "link": "https://search.shopping.naver.com/book/catalog/32884600766",
        "image": "https://shopping-phinf.pstatic.net/main_3288460/32884600766.20250429073323.jpg",
        "author": "",
        "discount": "70280",
        "publisher": "Springer",
        "pubdate": "20121228",
        "isbn": "9783031007682",
        "description": "In this book, we start from the data models for imprecise and uncertain data, move on to defining different semantics for queries on uncertain data, and finally discuss the advanced query processing techniques for various probabilistic queries in uncertain databases."
    },
    {
        "title": "Search Engine Optimization Using Query Processing",
        "link": "https://search.shopping.naver.com/book/catalog/32444943979",
        "image": "https://shopping-phinf.pstatic.net/main_3244494/32444943979.20250421074233.jpg",
        "author": "",
        "discount": "79550",
        "publisher": "LAP Lambert Academic Publishing",
        "pubdate": "20200410",
        "isbn": "9786202513203",
        "description": "Web search engines are widely used by everyone in the world. They are searching their each and every query through search engines. As a result, the number of users increases day by day. When the users increase, there is a need to increase the data centers and servers that holds the data. There may be some allocation or scheduling for every server in the data centers. When more number of users tries to search for a same query, the processing load increases results in CPU overhead."
    },
    {
        "title": "Excel Power Pivot and Power Query for Dummies",
        "link": "https://search.shopping.naver.com/book/catalog/32458991951",
        "image": "https://shopping-phinf.pstatic.net/main_3245899/32458991951.20250623094734.jpg",
        "author": "Alexander, Michael",
        "discount": "45490",
        "publisher": "For Dummies",
        "pubdate": "20160411",
        "isbn": "9781119210641",
        "description": ""
    },
    {
        "title": "Papua New Guinea Tok Pisin English Dictionary (Using Kusto Query Language for operations, defending, and threat hunting)",
        "link": "https://search.shopping.naver.com/book/catalog/50898361829",
        "image": "https://shopping-phinf.pstatic.net/main_5089836/50898361829.20250622101810.jpg",
        "author": "",
        "discount": "30880",
        "publisher": "Oxford University Press Australia",
        "pubdate": "20231002",
        "isbn": "9780195574029",
        "description": "The perfect dictionary for learners of English and Tok Pisin. This concise bilingual reference is the only one of its kind in the world, fully revised and updated to provide a comprehensive language tool. With double the size of the previous edition, it's an invaluable resource for speakers of Tok Pisin who want to improve their English, and speakers of English who want to learn Tok Pisin."
    },
    {
        "title": "Fuzzy Data Matching with SQL: Enhancing Data Quality and Query Performance",
        "link": "https://search.shopping.naver.com/book/catalog/42988109629",
        "image": "https://shopping-phinf.pstatic.net/main_4298810/42988109629.20250512080508.jpg",
        "author": "",
        "discount": "91000",
        "publisher": "O'Reilly Media",
        "pubdate": "20231128",
        "isbn": "9781098152277",
        "description": "In this practical book, author Jim Lehmer provides best practices, techniques, and tricks to help you import, clean, match, score, and think about heterogeneous data using SQL. Full of real-world techniques, the examples in the book contain working code."
    },
    {
        "title": "Aggregation Query Processing in P2P Networks",
        "link": "https://search.shopping.naver.com/book/catalog/32526438234",
        "image": "https://shopping-phinf.pstatic.net/main_3252643/32526438234.20250514085642.jpg",
        "author": "",
        "discount": "164650",
        "publisher": "KS OmniScriptum Publishing",
        "pubdate": "20121230",
        "isbn": "9783659307119",
        "description": "I.Aggregation Query Processing      II.Large Distributed database    III.Data Mining Hybrid approach    IV.A Novel Sampling Technique.       In P2P network when data is distributed over all the peers and we want to execute query within minimum time no any existing algorithm gives proper solution. So a Hybrid Data mining technique is used here for fast and efficient computing. It works mainly in four phases   1. Peer-to-Peer Node Construction  2. Random Selection of Node  3. Selection of Records."
    },
    {
        "title": "Programming Hive: Data Warehouse and Query Language for Hadoop (Data Warehouse and Query Language for Hadoop)",
        "link": "https://search.shopping.naver.com/book/catalog/32491006683",
        "image": "https://shopping-phinf.pstatic.net/main_3249100/32491006683.20250618084342.jpg",
        "author": "Edward Capriolo",
        "discount": "66580",
        "publisher": "O'Reilly Media",
        "pubdate": "20121006",
        "isbn": "9781449319335",
        "description": "Hive makes life much easier for developers who work with stored and managed data in Hadoop clusters, such as data warehouses. With this example-driven guide, you'll learn how to use the Hive infrastructure to provide data summarization, query, and analysis - particularly with HiveQL, the query language dialect of SQL. You'll learn how to set up Hive in your environment and optimize its use, and how it interoperates with other tools, such as HBase."
    },
    {
        "title": "Managing Time in Relational Databases: How to Design, Update and Query Temporal Data (How to Design, Update and Query Temporal Data)",
        "link": "https://search.shopping.naver.com/book/catalog/32490794547",
        "image": "https://shopping-phinf.pstatic.net/main_3249079/32490794547.20250422072942.jpg",
        "author": "Johnston, Tom",
        "discount": "131440",
        "publisher": "Elsevier Science Ltd",
        "pubdate": "20100713",
        "isbn": "9780123750419",
        "description": "Shows how to make the rich information content of bi-temporal data available to business users, while simplifying the design, maintenance and retrieval of that data. This book integrates an enterprise-wide viewpoint with a strong conceptual model of temporal data management allowing for realistic implementation of database application development."
    },
    {
        "title": "Data Mashup with Microsoft Excel Using Power Query and M (Finding, Transforming, and Loading Data from External Sources)",
        "link": "https://search.shopping.naver.com/book/catalog/47339847674",
        "image": "https://shopping-phinf.pstatic.net/main_4733984/47339847674.20250417074514.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20200722",
        "isbn": "9781484260197",
        "description": "Master the art of loading external data into Excel for use in reporting, charting, dashboarding, and business intelligence. This book provides a complete and thorough explanation of Microsoft Excel's Get and Transform feature set, showing you how to connect to a range of external databases and other data sources to find data and pull that data into your local spreadsheet for further analysis."
    },
    {
        "title": "Pro LINQ: Language Integrated Query in C# 2008",
        "link": "https://search.shopping.naver.com/book/catalog/32445156959",
        "image": "https://shopping-phinf.pstatic.net/main_3244515/32445156959.20250409072145.jpg",
        "author": "Rattz Joseph C., Jr.",
        "discount": "83230",
        "publisher": "Apress",
        "pubdate": "20070301",
        "isbn": "9781590597897",
        "description": "Foundations of LINQ in C# will help you run LINQ queries in a matter of minutes, with a solid understanding of the technology's implications in just a few hours. It features small, bite-sized chunks of information that make it possible to understand key principles in short periods of time. Throughout the book, concepts are demonstrated in practical ways. This book doesn't dwell on theory, but helps you put LINQ into practice."
    },
    {
        "title": "Database Repairs and Consistent Query Answering",
        "link": "https://search.shopping.naver.com/book/catalog/32884593723",
        "image": "https://shopping-phinf.pstatic.net/main_3288459/32884593723.20250623101158.jpg",
        "author": "",
        "discount": "70280",
        "publisher": "Springer",
        "pubdate": "20110822",
        "isbn": "9783031007552",
        "description": "The consistent data in an inconsistent database is usually characterized as the data that persists across all the database instances that are consistent and minimally differ from the inconsistent instance."
    },
    {
        "title": "Interactive Language Query System for Retrieving Alphanumeric Data From an Army Tactical Data System",
        "link": "https://search.shopping.naver.com/book/catalog/55863838898",
        "image": "https://shopping-phinf.pstatic.net/main_5586383/55863838898.20250719144029.jpg",
        "author": "",
        "discount": "29500",
        "publisher": "Hutson Street Press",
        "pubdate": "20250522",
        "isbn": "9781025065069",
        "description": "For a decade the United States Army has been investigating the uses of computers in the area of tactical operations. While demonstrating that computer based tactical data processing systems can provide useful assistance, field tests have uncovered some operational problems. One major problem has been the inability of prestructured formats to meet user requirements of flexibility and generality in querying the tactical data system for alphanumeric data."
    },
    {
        "title": "Interactive Language Query System for Retrieving Alphanumeric Data From an Army Tactical Data System",
        "link": "https://search.shopping.naver.com/book/catalog/55863841778",
        "image": "https://shopping-phinf.pstatic.net/main_5586384/55863841778.20250719144204.jpg",
        "author": "",
        "discount": "55400",
        "publisher": "Hutson Street Press",
        "pubdate": "20250522",
        "isbn": "9781025061207",
        "description": "For a decade the United States Army has been investigating the uses of computers in the area of tactical operations. While demonstrating that computer based tactical data processing systems can provide useful assistance, field tests have uncovered some operational problems. One major problem has been the inability of prestructured formats to meet user requirements of flexibility and generality in querying the tactical data system for alphanumeric data."
    },
    {
        "title": "Query Specific Multi Document Text Summarization",
        "link": "https://search.shopping.naver.com/book/catalog/35301986811",
        "image": "https://shopping-phinf.pstatic.net/main_3530198/35301986811.20221018155246.jpg",
        "author": "Gondkar- Vikhe Patil, Jyoti",
        "discount": "86950",
        "publisher": "LAP Lambert Academic Publishing",
        "pubdate": "20130509",
        "isbn": "9783659353741",
        "description": "Text Summarization is condensing the source text into a shorter version preserving its information content and overall meaning. It is very useful to help users grasp the main information related to a query. Query-oriented summarization aims at extracting an informative summary from a document collection for a given query. The main problem for generating an extractive automatic text summary is to detect the most relevant information in the source document."
    },
    {
        "title": "The Microsoft Excel Pivot Table Data Crunching Including Dynamic Arrays, Power Query, and Copilot (200 Mathematical Logic Puzzles)",
        "link": "https://search.shopping.naver.com/book/catalog/56225538050",
        "image": "https://shopping-phinf.pstatic.net/main_5622553/56225538050.20250812144500.jpg",
        "author": "",
        "discount": "70010",
        "publisher": "Pearson Education (US)",
        "pubdate": "20250207",
        "isbn": "9780135408797",
        "description": "Test your powers of logic with 200 puzzles from The Times."
    },
    {
        "title": "Master Your Data with Power Query in Excel and Power Bi: Leveraging Power Query to Get & Transform Your Task Flow (Leveraging Power Query to Get & Transform Your Task Flow)",
        "link": "https://search.shopping.naver.com/book/catalog/32543543490",
        "image": "https://shopping-phinf.pstatic.net/main_3254354/32543543490.20250429074101.jpg",
        "author": "",
        "discount": "53010",
        "publisher": "Holy Macro Books",
        "pubdate": "20191001",
        "isbn": "9781615470587",
        "description": "The low-carb, high-fat keto diet has become the go-to healthy diet. The Beginner's KetoDiet Cookbook is the guide to its all-important first weeks, or the ketosis induction."
    },
    {
        "title": "Database Repairing and Consistent Query Answering",
        "link": "https://search.shopping.naver.com/book/catalog/32511848742",
        "image": "https://shopping-phinf.pstatic.net/main_3251184/32511848742.20250616073545.jpg",
        "author": "",
        "discount": "74000",
        "publisher": "Morgan & Claypool",
        "pubdate": "20110824",
        "isbn": "9781608457625",
        "description": "Integrity constraints are semantic conditions that a database should satisfy in order to be an appropriate model of external reality. In practice, and for many reasons, a database may not satisfy those integrity constraints, and for that reason it is said to be inconsistent. However, and most likely, a large portion of the database is still semantically correct, in a sense that has to be made precise."
    },
    {
        "title": "Database Repairing and Consistent Query Answering",
        "link": "https://search.shopping.naver.com/book/catalog/47340566348",
        "image": "https://shopping-phinf.pstatic.net/main_4734056/47340566348.20250528071741.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20110822",
        "isbn": "9783031030116",
        "description": "Integrity constraints are semantic conditions that a database should satisfy in order to be an appropriate model of external reality. In practice, and for many reasons, a database may not satisfy those integrity constraints, and for that reason it is said to be inconsistent. However, and most likely, a large portion of the database is still semantically correct, in a sense that has to be made precise."
    },
    {
        "title": "Vertical Meta Search Engine with Query Expansion through ARFT",
        "link": "https://search.shopping.naver.com/book/catalog/32467244932",
        "image": "https://shopping-phinf.pstatic.net/main_3246724/32467244932.20250430073723.jpg",
        "author": "",
        "discount": "86950",
        "publisher": "LAP Lambert Academic Publishing",
        "pubdate": "20201015",
        "isbn": "9786202922401",
        "description": "World Wide Web is growing day by day so with this rapid development in internet size,Information extraction on Internet is gaining its importance day by day. Nowadays there aremillions of Websites and billions of homepages available on the Internet. A large amount of onlineinformation resides on the invisible web - web pages generated dynamically from databasesand other data sources hidden from the user."
    },
    {
        "title": "SQL Server 2008 Query Performance Tuning Distilled",
        "link": "https://search.shopping.naver.com/book/catalog/32491518990",
        "image": "https://shopping-phinf.pstatic.net/main_3249151/32491518990.20250627083834.jpg",
        "author": "Grant Fritchey",
        "discount": "101730",
        "publisher": "Apress",
        "pubdate": "20090316",
        "isbn": "9781430219026",
        "description": "Presenting troubleshooting methods for identifying poorly performing stored procedures and queries, this reference isolates the causes of that poor performance and offers suggestions for fixing the underlying problems. Developers, database administrators, and any others who develop Transact-SQL queries will find this book an indispensable resource."
    },
    {
        "title": "Microsoft SQL Server 2014 Query Tuning & Optimization",
        "link": "https://search.shopping.naver.com/book/catalog/32521474294",
        "image": "https://shopping-phinf.pstatic.net/main_3252147/32521474294.20250510075432.jpg",
        "author": "",
        "discount": "75850",
        "publisher": "McGraw-Hill/Osborne Media",
        "pubdate": "20141007",
        "isbn": "9780071829427",
        "description": "Filled with field-tested techniques for optimizing SQL Server 2014 databases, applications, and data warehouses for speed and performance-plus advanced troubleshooting tips for dealing with existing queries that are underperforming"
    },
    {
        "title": "Fundamentals of Physical Design and Query Compilation",
        "link": "https://search.shopping.naver.com/book/catalog/32884612654",
        "image": "https://shopping-phinf.pstatic.net/main_3288461/32884612654.20250605090445.jpg",
        "author": "",
        "discount": "70280",
        "publisher": "Springer",
        "pubdate": "20110727",
        "isbn": "9783031007538",
        "description": "Query compilation is the problem of translating user requests formulated over purely conceptual and domain specific ways of understanding data, commonly called logical designs, to efficient executable programs called query plans."
    },
    {
        "title": "Fundamentals of Physical Design and Query Compilation (Synthesis Lectures on Data Management)",
        "link": "https://search.shopping.naver.com/book/catalog/32445265697",
        "image": "https://shopping-phinf.pstatic.net/main_3244526/32445265697.20250527075325.jpg",
        "author": "Toman, David",
        "discount": "74000",
        "publisher": "Morgan & Claypool",
        "pubdate": "20101030",
        "isbn": "9781608452781",
        "description": "Query compilation is the problem of translating user requests formulated over purely conceptual and domain specific ways of understanding data, commonly called logical designs, to efficient executable programs called query plans. Such plans access various concrete data sources through their low-level often iterator-based interfaces. An appreciation of the concrete data sources, their interfaces and how such capabilities relate to logical design is commonly called a physical design."
    },
    {
        "title": "How to Write Attention Grabbing Query & Cover Letters",
        "link": "https://search.shopping.naver.com/book/catalog/32511653304",
        "image": "https://shopping-phinf.pstatic.net/main_3251165/32511653304.20250629074658.jpg",
        "author": "",
        "discount": "22730",
        "publisher": "Writer's Digest Books",
        "pubdate": "20000801",
        "isbn": "9781582970233",
        "description": "Provides professional guidance for all writing-related correspondence, be it a query to an editor, a request for a celebrity interview or a book proposal."
    },
    {
        "title": "Deep Web Query Interface Understanding and Integration",
        "link": "https://search.shopping.naver.com/book/catalog/32457899957",
        "image": "https://shopping-phinf.pstatic.net/main_3245789/32457899957.20250409073231.jpg",
        "author": "",
        "discount": "83250",
        "publisher": "Morgan & Claypool",
        "pubdate": "20120731",
        "isbn": "9781608458943",
        "description": "There are millions of searchable data sources on the Web and to a large extent their contents can only be reached through their own query interfaces. There is an enormous interest in making the data in these sources easily accessible. There are primarily two general approaches to achieve this objective. The first is to surface the contents of these sources from the deep Web and add the contents to the index of regular search engines."
    },
    {
        "title": "Deep Web Query Interface Understanding and Integration",
        "link": "https://search.shopping.naver.com/book/catalog/32895663627",
        "image": "https://shopping-phinf.pstatic.net/main_3289566/32895663627.20250528071724.jpg",
        "author": "",
        "discount": "70280",
        "publisher": "Springer",
        "pubdate": "20120614",
        "isbn": "9783031007613",
        "description": "The following technical issues are discussed in detail in this book: query interface modeling, query interface extraction, query interface clustering, query interface matching, query interface attribute integration, and query interface integration."
    },
    {
        "title": "Deep Web Query Interface Understanding and Integration",
        "link": "https://search.shopping.naver.com/book/catalog/47340566908",
        "image": "https://shopping-phinf.pstatic.net/main_4734056/47340566908.20250612080726.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20120614",
        "isbn": "9783031030178",
        "description": "There are millions of searchable data sources on the Web and to a large extent their contents can only be reached through their own query interfaces. There is an enormous interest in making the data in these sources easily accessible. There are primarily two general approaches to achieve this objective. The first is to surface the contents of these sources from the deep Web and add the contents to the index of regular search engines."
    },
    {
        "title": "Exploratory Search: Beyond the Query-Response Paradigm",
        "link": "https://search.shopping.naver.com/book/catalog/32917334628",
        "image": "https://shopping-phinf.pstatic.net/main_3291733/32917334628.20250512073755.jpg",
        "author": "",
        "discount": "51780",
        "publisher": "Springer",
        "pubdate": "20090301",
        "isbn": "9783031011320",
        "description": "As information becomes more ubiquitous and the demands that searchers have on search systems grow, there is a need to support search behaviors beyond simple lookup."
    },
    {
        "title": "Exploratory Search: Beyond the Query-Response Paradigm",
        "link": "https://search.shopping.naver.com/book/catalog/32445267097",
        "image": "https://shopping-phinf.pstatic.net/main_3244526/32445267097.20250619095908.jpg",
        "author": "White, Ryen",
        "discount": "55500",
        "publisher": "Morgan & Claypool",
        "pubdate": "20081130",
        "isbn": "9781598297836",
        "description": "As information becomes more ubiquitous and the demands that searchers have on search systems grow, there is a need to support search behaviors beyond simple lookup. Information seeking is the process or activity of attempting to obtain information in both human and technological contexts. Exploratory search describes an information-seeking problem context that is open-ended, persistent, and multifaceted, and information-seeking processes that are opportunistic, iterative, and multitactical."
    },
    {
        "title": "SQL Cookbook: Query Solutions and Techniques for Database Developers (Query Solutions and Techniques for Database Developers)",
        "link": "https://search.shopping.naver.com/book/catalog/32476762899",
        "image": "https://shopping-phinf.pstatic.net/main_3247676/32476762899.20260208090305.jpg",
        "author": "Molinaro, Anthony",
        "discount": "0",
        "publisher": "O'Reilly Media",
        "pubdate": "20051201",
        "isbn": "9780596009762",
        "description": "You know the rudiments of the SQL query language, yet you feel you aren't taking full advantage of SQL's expressive power. You'd like to learn how to do more work with SQL inside the database before pushing data across the network to your applications. You'd like to take your SQL skills to the next level. \nLet's face it, SQL is a deceptively simple language to learn, and many database developers never go far beyond the simple statement: SELECT FROM WHERE . But there is so much more you can do w..."
    },
    {
        "title": "Modern Data Analytics in Excel: Using Power Query, Power Pivot, and More for Enhanced Data Analytics",
        "link": "https://search.shopping.naver.com/book/catalog/47363597658",
        "image": "https://shopping-phinf.pstatic.net/main_4736359/47363597658.20260114071308.jpg",
        "author": "",
        "discount": "91000",
        "publisher": "O'Reilly Media",
        "pubdate": "20240604",
        "isbn": "9781098148829",
        "description": "If you haven't modernized your data cleaning and reporting processes in Microsoft Excel, you're missing out on big productivity gains. This practical book serves as an introduction to the modern Excel suite of features along with other powerful tools for analytics."
    },
    {
        "title": "Query Based Text Summarization using Machine learning Approach",
        "link": "https://search.shopping.naver.com/book/catalog/32492936638",
        "image": "https://shopping-phinf.pstatic.net/main_3249293/32492936638.20250426074739.jpg",
        "author": "",
        "discount": "86950",
        "publisher": "LAP Lambert Academic Publishing",
        "pubdate": "20190226",
        "isbn": "9786139452828",
        "description": "Extraction of relevant information on a specific query from rapidly growing data is a concern for quiet time in order to scan and analyze data from all the related documents. Therefore, text summarization is paramount research area these days. It is about to find most relevant information from single or multi-documents. A reasonable amount of work is done in this area to overcome extensive searching and to reduce the time required."
    },
    {
        "title": "Pro Data Mashup for Power BI (Powering Up with Power Query and the M Language to Find, Load, and Transform Data)",
        "link": "https://search.shopping.naver.com/book/catalog/47339829626",
        "image": "https://shopping-phinf.pstatic.net/main_4733982/47339829626.20250607080933.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20220826",
        "isbn": "9781484285794",
        "description": "This book provides all you need to find data from external sources and load and transform that data into Power BI where you can mine it for business insights and a competitive edge. This ranges from connecting to corporate databases such as Azure SQL and SQL Server to file-based data sources, and cloud- and web-based data sources. The book also explains the use of Direct Query and Live Connect to establish instant connections to databases and data warehouses and avoid loading data."
    },
    {
        "title": "Decentralized Query Processing over Heterogeneous Sources of Knowledge Graphs",
        "link": "https://search.shopping.naver.com/book/catalog/58228570286",
        "image": "https://shopping-phinf.pstatic.net/main_5822857/58228570286.20251222085247.jpg",
        "author": "",
        "discount": "152450",
        "publisher": "IOS PRESS",
        "pubdate": "20220301",
        "isbn": "9781643682600",
        "description": "From the artist of Ayakashi Triangle, To Love Ru (both also from Seven Seas), and Black Cat! This provocative sci-fi tale is the manga version of the hit anime - but with a divergent storyline."
    },
    {
        "title": "Efficient Query-Specific Summarization of Text Documents",
        "link": "https://search.shopping.naver.com/book/catalog/35303038825",
        "image": "https://shopping-phinf.pstatic.net/main_3530303/35303038825.20221018170033.jpg",
        "author": "Chowdary, Ravindranath",
        "discount": "120250",
        "publisher": "LAP Lambert Academic Publishing",
        "pubdate": "20101217",
        "isbn": "9783843382786",
        "description": "The World Wide Web (WWW) contains a huge amount of information and more is being added to it constantly. Search engines retrieve a large amount of information in response to a query, from which, the user has to select some amount of information to satisfy her information need. Often, information is distributed over multiple web pages. It is a tedious task for the user to go through all the web pages to fulfill her need."
    },
    {
        "title": "Estimating the Query Difficulty for Information Retrieval",
        "link": "https://search.shopping.naver.com/book/catalog/32487798215",
        "image": "https://shopping-phinf.pstatic.net/main_3248779/32487798215.20250621095412.jpg",
        "author": "Carmel, David",
        "discount": "64750",
        "publisher": "Morgan & Claypool",
        "pubdate": "20100915",
        "isbn": "9781608453573",
        "description": "Many information retrieval (IR) systems suffer from a radical variance in performance when responding to users' queries. Even for systems that succeed very well on average, the quality of results returned for some of the queries is poor. Thus, it is desirable that IR systems will be able to identify \"difficult\" queries so they can be handled properly."
    },
    {
        "title": "Estimating the Query Difficulty for Information Retrieval",
        "link": "https://search.shopping.naver.com/book/catalog/47340567124",
        "image": "https://shopping-phinf.pstatic.net/main_4734056/47340567124.20250628071740.jpg",
        "author": "",
        "discount": "73980",
        "publisher": "Springer Nature B.V.",
        "pubdate": "20100427",
        "isbn": "9783031034008",
        "description": "Many information retrieval (IR) systems suffer from a radical variance in performance when responding to users' queries. Even for systems that succeed very well on average, the quality of results returned for some of the queries is poor. Thus, it is desirable that IR systems will be able to identify \"difficult\" queries so they can be handled properly."
    },
    {
        "title": "Hashing based effective indexing for video retrieval using text query",
        "link": "https://search.shopping.naver.com/book/catalog/32467975724",
        "image": "https://shopping-phinf.pstatic.net/main_3246797/32467975724.20250421073834.jpg",
        "author": "",
        "discount": "111000",
        "publisher": "LAP Lambert Academic Publishing",
        "pubdate": "20200429",
        "isbn": "9786202530040",
        "description": "This book more focuses on e-lecture video retrieval using text quires for searching appropriate lecture videos accurately and within less time using hashing techniques.On World Wide Web e-lecturing data of videos is increasing very fast. Thus efficient retrieval and indexing of video from large video databases is needed. We can use text appearing in lecture videos as index. It enables content-based browsing. We present method of hashing for efficient search of text in videos."
    },
    {
        "title": "Exam Prep for Microsoft SQL Server 2014 Query Tuning & Optimization",
        "link": "https://search.shopping.naver.com/book/catalog/51447609748",
        "image": "https://shopping-phinf.pstatic.net/main_5144760/51447609748.20260118090153.jpg",
        "author": "",
        "discount": "0",
        "publisher": "Content Technologies, Inc.",
        "pubdate": "20190818",
        "isbn": "9781538845431",
        "description": "Computer science is the theory, experimentation, and engineering that form the basis for the design and use of computers."
    },
    {
        "title": "Implementation of Smooth Spatial Query Processing in Spatial Databases",
        "link": "https://search.shopping.naver.com/book/catalog/33378924700",
        "image": "https://shopping-phinf.pstatic.net/main_3337892/33378924700.20250628071156.jpg",
        "author": "",
        "discount": "81400",
        "publisher": "LAP Lambert Academic Publishing",
        "pubdate": "20200428",
        "isbn": "9786202531191",
        "description": "Spatial database is a database that is optimized to store and query data. Inorder to process spatial database a set of functions are needed to process spatial data types called geometry or feature. These set of function are designed by spatial database query framework called Open Geospatial Consortium (OGC). In this work we have designed Open Geospatial Consortium that will process spatial and nonspatial queries."
    },
    {
        "title": "Graph Based Query Specific Multi-Document Text Summarization",
        "link": "https://search.shopping.naver.com/book/catalog/32462369789",
        "image": "https://shopping-phinf.pstatic.net/main_3246236/32462369789.20250530074055.jpg",
        "author": "Pandit, Sandip Ramkrishna",
        "discount": "81400",
        "publisher": "LAP Lambert Academic Publishing",
        "pubdate": "20141112",
        "isbn": "9783659636608",
        "description": "Recently the focus of query independent summary is shifted to query specific document. This book presents a graph based method to find query specific multi-document summarization. Our system is divided into two stages, of- fline and online. We construct document as graph by con- sidering paragraph as nodes in offline stage. Edge scores are represented node similarities. In online stage, query specific weight are calculated and assigned to node."
    },
    {
        "title": "Getting Started with the Graph Query Language (GQL): A complete guide to designing, querying, and managing graph databases with GQL",
        "link": "https://search.shopping.naver.com/book/catalog/56117121009",
        "image": "https://shopping-phinf.pstatic.net/main_5611712/56117121009.20251210072246.jpg",
        "author": "Sun, Ricky^Zhang, Jason^Simione, Yuri",
        "discount": "39000",
        "publisher": "Packt Publishing",
        "pubdate": "20250822",
        "isbn": "9781836204015",
        "description": "Learn how to build and query graph databases with this first comprehensive guide to ISO-standard GQL featuring 50+ hands-on examples and a real-world case study that will change the way you work with connected dataKey Features:- Go beyond theory and apply key concepts and syntax through interactive tutorials and practical examples via the GQL Playground- Leverage advanced features of GQL to manipulate graph data efficiently- Explore GQL applications in data analytics and discover how to leverage"
    },
    {
        "title": "Around and About South America: Twenty months of quest and query",
        "link": "https://search.shopping.naver.com/book/catalog/57393860626",
        "image": "https://shopping-phinf.pstatic.net/main_5739386/57393860626.20260117072720.jpg",
        "author": "",
        "discount": "107110",
        "publisher": "Hansebooks",
        "pubdate": "20170908",
        "isbn": "9783337314330",
        "description": "Around and About South America - Twenty months of quest and query is an unchanged, high-quality reprint of the original edition  of 1890.\nHansebooks is editor of the literature on different topic areas such as research and science, travel and expeditions, cooking and nutrition, medicine, and other genres. As a publisher we focus on the preservation of historical literature. Many works of historical writers and scientists are available today as antiques only."
    },
    {
        "title": "Database Design, Query Formulation, and Administration: Using Oracle and PostgreSQL, 8/E",
        "link": "https://search.shopping.naver.com/book/catalog/55336804725",
        "image": "https://shopping-phinf.pstatic.net/main_5533680/55336804725.20251027074501.jpg",
        "author": "Mannino, Michael",
        "discount": "75050",
        "publisher": "Sage",
        "pubdate": "20220915",
        "isbn": "9781948426954",
        "description": "Formerly published by Chicago Business Press, now published by Sage\n\nDatabase Design, Query Formulation, and Administration, Eighth Edition,offers a comprehensive understanding of database technology."
    },
    {
        "title": "Power Pivot and Power Bi: The Excel User’s Guide to Dax, Power Query, Power Bi & Power Pivot in Excel 2010-2016 (The Excel User’s Guide to Dax, Power Query, Power Bi & Power Pivot in Excel 2010-2016)",
        "link": "https://search.shopping.naver.com/book/catalog/32460912205",
        "image": "https://shopping-phinf.pstatic.net/main_3246091/32460912205.20250608074629.jpg",
        "author": "Singh, Avichal^Collie, Rob",
        "discount": "46940",
        "publisher": "Holy Macro! Books",
        "pubdate": "20211201",
        "isbn": "9781615470754",
        "description": "How China became the China we know today, through war and societal transformation."
    },
    {
        "title": "An Access Definition and Query Language: Towards a Unified Access Control Model",
        "link": "https://search.shopping.naver.com/book/catalog/51446908412",
        "image": "https://shopping-phinf.pstatic.net/main_5144690/51446908412.20260208090402.jpg",
        "author": "",
        "discount": "0",
        "publisher": "Saint Philip Street Press",
        "pubdate": "20201009",
        "isbn": "9781013281884",
        "description": "In this work we suggest a meta access control model emulating established access control models by configuration and offering enhanced features like the delegation of rights, ego-centered roles, and decentralized administration. The suggested meta access control model is named ''Access Definition and Query Language'' (ADQL). ADQL is represented by a formal, context-free grammar allowing to express the targeted access control model, policies, facts, and access queries as a formal language."
    },
    {
        "title": "Advanced Applications and Structures in XML Processing (Label Streams, Semantics Utilization and Data Query Technologies)",
        "link": "https://search.shopping.naver.com/book/catalog/32520319632",
        "image": "https://shopping-phinf.pstatic.net/main_3252031/32520319632.20250515084254.jpg",
        "author": "",
        "discount": "333000",
        "publisher": "Igi Global",
        "pubdate": "20100228",
        "isbn": "9781615207275",
        "description": "Much of the world's advanced data processing applications are now dependant on eXtensible Markup Language (XML), from publishing to medical information storage. Therefore, XML has become a de facto standard for data exchange and representation on the World Wide Web and in daily life."
    },
    {
        "title": "Query Store for SQL Server 2019: Identify and Fix Poorly Performing Queries (Identify and Fix Poorly Performing Queries)",
        "link": "https://search.shopping.naver.com/book/catalog/35300689697",
        "image": "https://shopping-phinf.pstatic.net/main_3530068/35300689697.20221018143212.jpg",
        "author": "Boggiano, Tracy^Fritchey, Grant",
        "discount": "70280",
        "publisher": "Apress",
        "pubdate": "20191110",
        "isbn": "9781484250037",
        "description": "Intermediate-Advanced user level"
    },
    {
        "title": "Scalable Data Analytics with Azure Data Explorer (Modern ways to query, analyze, and perform real-time data analysis on large volumes of data)",
        "link": "https://search.shopping.naver.com/book/catalog/32533801842",
        "image": "https://shopping-phinf.pstatic.net/main_3253380/32533801842.20250406071609.jpg",
        "author": "",
        "discount": "92480",
        "publisher": "Packt Publishing",
        "pubdate": "20220318",
        "isbn": "9781801078542",
        "description": "Developers working with large amounts of data on Azure, including App Insights and Log Analytics, will be able to put their knowledge to work with this practical guide. The book focuses on Azure Data Explorer, covering topics such as data ingestion from multiple sources and querying and generating reports to make data-driven decisions."
    },
    {
        "title": "Principles of Database Query Processing for Advanced Applications",
        "link": "https://search.shopping.naver.com/book/catalog/32546680823",
        "image": "https://shopping-phinf.pstatic.net/main_3254668/32546680823.20250426072434.jpg",
        "author": "",
        "discount": "156570",
        "publisher": "Morgan Kaufmann",
        "pubdate": "19971201",
        "isbn": "9781558604346",
        "description": "A thorough presentation of query processing techniques in a broad range of database systems for advanced applications. Provides the most effective query processing techniques and ways to optimize the information retrieval process. Intended for dat..."
    },
    {
        "title": "Learn SQL Database Programming: Query and manipulate databases from popular relational database servers using SQL (Query and manipulate databases from popular relational database servers using SQL)",
        "link": "https://search.shopping.naver.com/book/catalog/32472237638",
        "image": "https://shopping-phinf.pstatic.net/main_3247223/32472237638.20250617083749.jpg",
        "author": "Bush, Josephine",
        "discount": "73980",
        "publisher": "Packt Publishing",
        "pubdate": "20200529",
        "isbn": "9781838984762",
        "description": "Learn everything you need to know to build efficient SQL queries using this easy-to-follow beginner’s guideKey Features\n\n\tExplore all SQL statements in depth using a variety of examples\n\tGet to grips with database querying, data aggregate, manipulation, and much more\n\tUnderstand how to explore and process data of varying complexity to tell a story\n\n\nBook Description\nSQL is a powerful querying language that's used to store, manipulate, and retrieve data, and it is one of the most popular languag"
    },
    {
        "title": "Power BI Data Modeling (Build Interactive Visualizations, Learn DAX, Power Query, and Develop BI Models (English Edition))",
        "link": "https://search.shopping.naver.com/book/catalog/32492885808",
        "image": "https://shopping-phinf.pstatic.net/main_3249288/32492885808.20250621095305.jpg",
        "author": "",
        "discount": "55400",
        "publisher": "BPB Publications",
        "pubdate": "20220321",
        "isbn": "9789389328837",
        "description": "TAGLINE?Build Power BI Models Efficiently and Effectively??DESCRIPTION?Creating data models has never been straightforward. This book demonstrates how to formulate a complete business analytics model that combines several data sources, executes numerous computations, and scales across hundreds of BI users.To begin, you'll learn about the Microsoft Power BI ecosystem by downloading the Power BI desktop and exploring all of its features and capabilities."
    },
    {
        "title": "SQL Server Query Tuning and Optimization: Optimize Microsoft SQL Server 2022 queries and applications (Optimize Microsoft SQL Server 2022 queries and applications)",
        "link": "https://search.shopping.naver.com/book/catalog/33805616648",
        "image": "https://shopping-phinf.pstatic.net/main_3380561/33805616648.20250414075255.jpg",
        "author": "",
        "discount": "78860",
        "publisher": "Packt Publishing Limited",
        "pubdate": "20220812",
        "isbn": "9781803242620",
        "description": "This book helps you get up to speed with both query engine internals and practical query optimization. As you progress, you'll explore ready-to-use techniques for creating high-performance queries and applications."
    },
    {
        "title": "Quality-Driven Query Answering for Integrated Information Systems 반양장",
        "link": "https://search.shopping.naver.com/book/catalog/32465515687",
        "image": "https://shopping-phinf.pstatic.net/main_3246551/32465515687.20220519200327.jpg",
        "author": "Naumann, Felix",
        "discount": "101730",
        "publisher": "Springer",
        "pubdate": "20020401",
        "isbn": "9783540433491",
        "description": "The building which houses the international headquarters of Nestl SA in Vevey, Switzerland succeeds in conveying the fascination of Swiss post-war modernism like no other. Idyllically located on Lake Geneva, set in a landscaped park, this masterpiece from the renowned architect Jean Tschumi combines the essential features of modern architecture with spaciousness and elegance. Jacques Richter and Ignacio Dahl Rocha have spent many years renovating, modernising and extending this remarkable building. Their transformation has become a manifesto for an intuitive and creative approach to working with historical monuments. This book documents this exemplary building and its recent transformation, touching on a wide range of issues, and providing fascinating glimpses into topics such as Le Corbusier as Nestls exhibition architect, our approach to historical monuments of the 20th century, the architecture of Jean Tschumi, and the work of Richter and Dahl Rocha."
    }
]